# Brewfile — managed by ~/.mydotfiles
# Run: brew bundle --file=~/.mydotfiles/Brewfile

# ── Shell & terminal utilities ────────────────────────────────────────────────
brew "starship"          # Cross-shell prompt
brew "docker-compose"    # Docker Compose
brew "zsh-completions"   # Additional completions
brew "bat"               # cat with syntax highlighting
brew "eza"               # Modern ls replacement
brew "fd"                # Modern find
brew "fzf"               # Fuzzy finder
brew "ripgrep"           # Fast grep
brew "jq"                # JSON processor
brew "yq"                # YAML processor
brew "zoxide"            # Smarter cd
brew "tlrc"              # Simplified man pages (tldr client)
brew "tree"              # Directory tree viewer
brew "watch"             # Execute command periodically
brew "wget"              # File downloader
brew "curl"              # Transfer tool
brew "htop"              # Interactive process viewer
brew "bottom"            # System resource monitor (btm)
brew "tmux"              # Terminal multiplexer
brew "stow"              # Symlink manager (alternative to link.sh)
brew "direnv"            # Per-directory env vars
brew "age"               # Modern encryption tool
brew "sops"              # Secrets manager for files
brew "gnupg"             # GPG tooling


# ── Git & VCS ─────────────────────────────────────────────────────────────────
brew "git"
brew "git-delta"         # Better git diffs
brew "lazygit"           # TUI git client
brew "gh"                # GitHub CLI
brew "glab"              # GitLab CLI
brew "git-lfs"           # Large file storage

# ── Cloud & infrastructure ────────────────────────────────────────────────────
brew "azure-cli"         # az
#brew "terraform"         # IaC
brew "terragrunt"        # Terraform wrapper
brew "tflint"            # Terraform linter
brew "checkov"           # IaC security scanner (via pip preferred)
brew "doctl"             # DigitalOcean CLI
brew "pulumi"            # Alternative IaC

# ── Kubernetes & containers ───────────────────────────────────────────────────
brew "kubectl"
brew "kubectx"           # Switch contexts/namespaces
brew "k9s"               # Kubernetes TUI
brew "helm"              # Kubernetes package manager
brew "kustomize"         # Kubernetes manifest customization
brew "stern"             # Multi-pod log tailing
brew "kubeseal"          # Sealed secrets
brew "kind"              # Local Kubernetes clusters
brew "minikube"          # Local Kubernetes

# ── Python ────────────────────────────────────────────────────────────────────
brew "python@3.12"
brew "uv"                # Fast Python package manager
brew "pyenv"             # Python version manager

# ── Data & Databricks ─────────────────────────────────────────────────────────
#brew "databricks"        # Databricks CLI
#brew "postgresql@16"     # PostgreSQL client tools
#brew "mysql-client"      # MySQL client

# ── Networking & SSH ─────────────────────────────────────────────────────────
brew "openssh"
brew "mosh"              # Mobile shell
brew "nmap"              # Network scanner
brew "httpie"            # HTTP client
brew "grpcurl"           # gRPC client

# ── Editors & tools ───────────────────────────────────────────────────────────
brew "neovim"            # Nvim (LazyVim base)
brew "vim"
brew "nano"

# ── Misc dev utilities ────────────────────────────────────────────────────────
brew "make"
brew "cmake"
brew "gcc"
brew "go"
brew "node"
brew "yarn"
brew "pnpm"
brew "pre-commit"        # Git hook manager
brew "hadolint"          # Dockerfile linter
brew "trivy"             # Container vulnerability scanner
brew "act"               # Run GitHub Actions locally
brew "glow"              # Markdown renderer in terminal
brew "slides"            # Terminal presentation

# ── Casks (GUI applications) ─────────────────────────────────────────────────
# [jamf] = commonly managed by corporate MDM; brew will skip if already installed
cask "ghostty"           # Ghostty Terminal
cask "raycast"           # Spotlight replacement
cask "google-chrome"     # [jamf] often pre-installed by MDM
cask "tablepro"
# Container runtime — machine-specific, see Brewfile.local.example
cask "dbeaver-community" # Database GUI
cask "pycharm"           # Python IDE
cask "zed"               # Fast code editor
cask "sublime-text"
cask "claude"            # Claude desktop app
cask "insomnia"          # API client (alternative)
cask "proxyman"          # HTTP proxy debugger
cask "fork"              # Git GUI
cask "obsidian"          # Note-taking
cask "rectangle"         # Window manager  [jamf] needs Accessibility — PPPC profile required
cask "stats"             # System stats in menu bar
cask "alt-tab"           # Windows-style alt-tab [jamf] needs Accessibility — PPPC profile required
cask "whatsapp"          # personal only
cask "telegram"          # personal only

# ── Fonts (Nerd Fonts for Starship/Neovim icons) ─────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
